20220115160226-the_consumer_price_index_is_not_actionable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-20 Tue 14:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Consumer Price Index is not actionable</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">The Consumer Price Index is not actionable</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220103161656-economics.html#ID-5fecd21c-5701-48af-9fd8-a2a2ab9b36a8">Economics</a> <a href="20210514171828-inflation.html#ID-d0110ef7-f82f-4568-bb0d-9ac077994b8e">Inflation</a> <a href="20220108211402-consumer_price_index.html#ID-b5f5e019-e22f-49b6-bfb5-ef03c8b0c41b">Consumer Price Index</a></dd>
</dl>


<p>
The Consumer Price Index is often used as a proxy or inflation. It was meant as a desciption, a mere state of affairs. But it is not actionable, it does not tell us exactly what is making the prices increase and how they are increasing. It is all veyr obvious and yet people are using this as a proxy for the general increase in prices levels.
</p>


<p>
Two facts need explaining:
</p>
<ul class="org-ul">
<li>The CPI has kept increasing since the 1940s</li>
<li><a href="20220116212357-the_cpi_increases_faster_since_the_70s.html#ID-7be372a6-07f8-4ee7-b12c-5a9747c46c83">The CPI has been increasing faster since the 70s</a></li>
</ul>


<div id="outline-container-org7933018" class="outline-2">
<h2 id="org7933018">Decompose the CPI</h2>
<div class="outline-text-2" id="text-org7933018">
<p>
The CPI is computed using price indices computed monthly in different locations in the US. The data can be found on the <a target='_blank' rel='noopener noreferrer' class='external' href="https://download.bls.gov/pub/time.series/ap/">website of the Bureau of Labor Statistics</a>. We can also find the <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.bls.gov/opub/hom/cpi/calculation.htm">methodology</a> on the website.
</p>
</div>
</div>


<div id="outline-container-org4efaad0" class="outline-2">
<h2 id="org4efaad0">Links to this note</h2>
<div class="outline-text-2" id="text-org4efaad0">
<ul class="org-ul">
<li><a href="./20220116204214-there_is_no_theory_of_inflation.html">There is no theory of inflation</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>